{
    "version": "https://jsonfeed.org/version/1",
    "title": "TritaVlogCast",
    "description": "",
    "home_page_url": "https://prenticepoint.github.io/tritavlogcast",
    "feed_url": "https://prenticepoint.github.io/tritavlogcast/feed.json",
    "user_comment": "",
    "icon": "https://prenticepoint.github.io/tritavlogcast/media/website/new_logo_tvc-removebg-preview.png",
    "author": {
        "name": "1tritagonist"
    },
    "items": [
        {
            "id": "https://prenticepoint.github.io/tritavlogcast/give-for-the-cause.html",
            "url": "https://prenticepoint.github.io/tritavlogcast/give-for-the-cause.html",
            "title": "Give for the Cause",
            "summary": " For more details how to be a part Message me on Facebook ",
            "content_html": "\n  <p>\n    For more details how to be a part\n  </p>\n\n    <h2 id=\"message-me-on-facebook\">\n      <a href=\"https://m.me/tritavlogcast\" target=\"_blank\">\n      Message me on Facebook\n      </a>\n    </h2>",
            "author": {
                "name": "1tritagonist"
            },
            "tags": [
            ],
            "date_published": "2021-12-05T18:45:36+08:00",
            "date_modified": "2021-12-05T18:45:36+08:00"
        },
        {
            "id": "https://prenticepoint.github.io/tritavlogcast/an-overview-of-genesis-by-stanford-e-murrell.html",
            "url": "https://prenticepoint.github.io/tritavlogcast/an-overview-of-genesis-by-stanford-e-murrell.html",
            "title": "AN OVERVIEW OF GENESIS by Stanford E. Murrell",
            "summary": "REBLOG Divine Author: God the Holy Spirit “All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction,&hellip;",
            "content_html": "<p><strong>REBLOG</strong></p>\n<h1 class=\"entry-title\">AN OVERVIEW OF GENESIS</h1>\n<div class=\"entry-meta\"><span class=\"entry-author byline\"><span class=\"sep\">by</span> <span class=\"author vcard\"><a class=\"url fn n\" href=\"https://stanmurrell.org/author/stanfordmurrell/\" rel=\"author\" itemprop=\"url\">Stanford E. Murrell</a></span></span></div>\n<div>source link: <a href=\"https://stanmurrell.org/2021/11/10/an-overview-of-genesis/\" target=\"_blank\" rel=\"noopener noreferrer\">An Overview of Genesis| Reedeming Grace Ministry</a><a href=\"http://gestyy.com/ep4ARR\" target=\"_blank\" rel=\"sponsored noopener noreferrer\"></a></div>\n<div> </div>\n<div>\n<div class=\"entry-sidebar-wrapper\"><span class=\"entry-date\"><a href=\"https://stanmurrell.org/2021/11/10/an-overview-of-genesis/\" rel=\"bookmark\"><time class=\"entry-time published\" datetime=\"2021-11-10T14:05:18-04:00\"><span class=\"day\">NOV</span> <span class=\"month\">10</span> <span class=\"year\">2021</span></time></a></span></div>\n<div class=\"entry-content-wrapper\">\n<div class=\"entry-content\">\n<p><strong>Divine Author: </strong>God the Holy Spirit “All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness” (2 Tim. 3:16).</p>\n<p><strong>Human Author</strong>: Moses is the assumed author.</p>\n<p><strong>Date: </strong>c. 1440-1400 BC</p>\n<p><strong>Setting: </strong>Ur of the Chaldees, Canaan, Egypt  </p>\n<p><strong>Key Verse: </strong>Genesis 1:1, “In the beginning God created the heaven and the earth.”           </p>\n<p><strong>Theme : </strong>The origin of all things</p>\n<p><strong>General Facts: </strong>1<sup>st</sup> Book of the Bible; 50 Chapters; 1, 533 Verses</p>\n<p class=\"has-text-align-center\">* * *</p>\n<p>In the Book of Genesis, the origin of every facet of creation is introduced. Since God is not a created being, but is eternal, the Scriptures do not seek to prove His existence, but merely assert, “In the beginning God” (v. 1). If a person can believe the first four words of the Bible, the rest will prove no difficulty in accepting.</p>\n<p>In the Book of Genesis, the three greatest questions of life are answered.</p>\n<p><em>Question</em>: “Where did I come from?”<br><em>Answer</em>: “I came from the hand of the God who created me.” Genesis 1:27; 5:2</p>\n<p><em>Question</em>: “Why am I here?”<br><em>Answer</em>: “I am here to know God and enjoy Him forever.” Genesis 3:8</p>\n<p><em>Question</em>: “Where am I going?”<br><em>Answer</em>: “If I believe in God, I am going to a better place.” Genesis 15:6</p>\n<p>In the Book of Genesis is the <em>protoevangelium,</em> a compound of two Greek words, protos, meaning “first” and “evangelion”, meaning, “good news,” or, “gospel”. The <em>protoevanglium</em> in Genesis 3:15 is the first mention of the good news of salvation in Scripture. It is the Old Testament counterpart to John 3:16 in the New Testament.</p>\n<p>The Covenant of Grace Promised. “And I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel” (Gen. 3:15).</p>\n<p><em>Consider</em></p>\n<p>The Lord promised that one day a seed, or descendant, of the woman, would crush the head of the serpent. The meaning is that one day Messiah would destroy the works of the devil. However, the blow that be struck was not to be delivered without a cost for, the serpent was to bruise the heel of the Messiah.</p>\n<p>The Covenant of Grace Fulfilled. “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life” (John 3:16).</p>\n<p><strong>Two Major Division in the Book of Genesis</strong>: <strong>First Division: Genesis 1 – 11</strong></p>\n<p>The early chapters of Genesis record the creation (1 -2); the Fall of Man (3 -5); the Flood (6 – 9); and the origin of nations, following the incident at the Tower of Babel (10 -11).</p>\n<p>We find in the Book of Genesis that God created a beautiful universe that was very good, until sin entered into the world. There was the sin of Satan, and then the sin of Adam. Study Isaiah 14; Romans 5</p>\n<p>The entry of sin into God’s creation led to a universal change in nature, and the necessity for a plan of salvation, lest everything perish. In the Garden of Eden, where sin abounded, grace did much more abound, as the <em>protoevangelium</em> was proclaimed (3:15).</p>\n<p>The gospel was needed because every imagination of man’s heart became evil, continually (6:5). In white-hot holy anger, God was determined to judge mankind with a universal flood. But Noah found grace in the eyes of the Lord (6:8). Eight lives would be spared, the cleansed earth would be repopulated, and God’s Covenant of Grace would be honored.</p>\n<p><strong>The Second Fall, After the Flood</strong></p>\n<p>Unfortunately, after the Flood, Noah too fell into sin, with far reaching consequences. After planting a vineyard, Noah enjoyed the fruit of his labors to the point he became inebriated. While Noah was drunk, one of his sons does something shameful to his father. “And Noah awoke from his wine, and knew what his younger son had done unto him” (Gen. 9:24). Once more, a “new Adam” is found naked, and ashamed. The downward spiral of human depravity continues, leading to the foundation of the city of Babylon.</p>\n<p><strong>A Tower of Confusion</strong></p>\n<p>Following the story of Noah, and the curse he put on Canaan, the son of Ham, the Bible details a Table of Nations in Genesis 10. There was a population explosion as the descendants of Noah, Shem, Ham, and Japheth spread out over the Mesopotamia Valley.</p>\n<p>It was an amazing time in human history, for “the whole earth was of one language, and of one speech” (11:1). People were connected in life, and united in any purpose that was undertaken. Unfortunately, the unity of the human race became its greatest source of danger. The Bible explains the Lord’s concern. “And the Lord said, Behold, the people is one, and they have all one language; and this they begin to do: and now nothing will be restrained from them, which they have imagined to do” (11:6).</p>\n<p>With their ability to build bigger and better buildings, the Lord knew the people in the Mesopotamia Valley (modern Iraq) would build a monument to human pride leading to false worship. To arrest this madness, the Lord humbled the people by confusing their tongues in order to scatter them.</p>\n<p><strong>A Common Theme Genesis 1 – 11</strong></p>\n<p>If there is a common theme to the stories of Genesis 1 – 11, it is that the opportunities the Lord gives individuals are squander through rebellion, lack of self-control, and inordinate pride. A good world can be turned into an evil place when the Lord is forsaken, and humanity is exalted. However, there is hope, for the first section ends with promise still in view of a Wounded Victor who would come to defeat evil, and crush the head of the serpent. The Lord will bless, and preserve His world.</p>\n<figure class=\"wp-block-image size-full\"><figure class=\"wp-image-10341 jetpack-lazy-image jetpack-lazy-image--handled\"><img loading=\"lazy\"  src=\"https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?resize=564%2C523&amp;ssl=1\" data-is-external-image=\"true\"  sizes=\"(max-width: 564px) 100vw, 564px\" srcset=\"https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?w=564&amp;ssl=1 564w, https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?resize=300%2C278&amp;ssl=1 300w, https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?resize=150%2C139&amp;ssl=1 150w\" alt=\"\" width=\"564\" height=\"523\" data-attachment-id=\"10341\" data-permalink=\"https://stanmurrell.org/2021/11/10/an-overview-of-genesis/gen1/\" data-orig-file=\"https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?fit=564%2C523&amp;ssl=1\" data-orig-size=\"564,523\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Gen1\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?fit=300%2C278&amp;ssl=1\" data-large-file=\"https://i0.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen1.png?fit=564%2C523&amp;ssl=1\" data-recalc-dims=\"1\" data-lazy-loaded=\"1\"></figure></figure>\n<p><strong>Second Division: Genesis 12 – 50</strong></p>\n<p>Chapters 12 – 50 of Genesis records the history of the Patriarchs. Four individuals are prominent: Abraham (12 – 25:8); Isaac (21:1-35); Jacob (25:21-50:4); and Joseph (30:22 – 50:26).</p>\n<p>Because God works His plan of redemption through individuals, the man named Abram (Heb. “exalted father”), from Ur of the Chaldees (modern Sanlurfa, Turkey) was chosen to give birth to a race that would become a nation, that would produce the Savior of the world, the Son of God, the Messiah, Jesus Christ.</p>\n<p> <strong>A Closer Look</strong></p>\n<p>To facilitate the coming Messiah, God called the man Abram to become the father of a<em> great</em> nation that would be known as Israel. “And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing” (Gen. 12:2). To confirm this Covenant of Promise, the Lord made a Covenant with Abram (17:1-22), and changed his name to Abraham (Heb. “father of a multitude”). Abraham gave birth to Isaac, who gave birth to Jacob, to whom were born the leaders of the tribes of Israel.</p>\n<p><strong>Seven Promises of the Abrahamic Covenant: Genesis 12:2-3; 15:1- 6; 17:1-16</strong></p>\n<ul>\n<li>There is the promise of a great nation through Abraham.</li>\n<li>There is the promise of a personal blessing on Abraham.</li>\n<li>There is the promise the name of Abraham shall be great.</li>\n<li>There is the promise Abraham is to be a blessing to others.</li>\n<li>There is the promise that a blessing will rest on those blessing Abraham.</li>\n<li>There is the promise that a curse will rest on those who curse Abraham.</li>\n<li>There is the promise that all nations of the earth will be blessed through Abraham.</li>\n</ul>\n<p>Abraham obeyed the Lord. He left Ur and made his way to Canaan in order to possess the land, which God said would be given to him. “And he said unto him )Abraham(, I am the Lord that brought thee out of Ur of the Chaldees, to give thee this land to inherit it” (Gen. 15:7).</p>\n<figure class=\"wp-block-image size-full\"><figure class=\"wp-image-10342 jetpack-lazy-image jetpack-lazy-image--handled\"><img loading=\"lazy\"  src=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?resize=247%2C379&amp;ssl=1\" data-is-external-image=\"true\"  sizes=\"(max-width: 247px) 100vw, 247px\" srcset=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?w=247&amp;ssl=1 247w, https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?resize=196%2C300&amp;ssl=1 196w, https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?resize=98%2C150&amp;ssl=1 98w\" alt=\"\" width=\"247\" height=\"379\" data-attachment-id=\"10342\" data-permalink=\"https://stanmurrell.org/2021/11/10/an-overview-of-genesis/gen2/\" data-orig-file=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?fit=247%2C379&amp;ssl=1\" data-orig-size=\"247,379\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Gen2\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?fit=196%2C300&amp;ssl=1\" data-large-file=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen2.png?fit=247%2C379&amp;ssl=1\" data-recalc-dims=\"1\" data-lazy-loaded=\"1\"></figure></figure>\n<p><strong>Boundaries of the Promised Land Different Spirit</strong></p>\n<p>I will plant Israel in their own land, never again to be uprooted from the land I have given them”</p>\n<p>~ Amos 9:15</p>\n<p>Some 3,500 years ago the Canaanites inhabited the land that God promised to give to the offspring of Abraham, Isaac, and Jacob (see Timeline). God promised that He would give the land of Israel to the Jewish people as an eternal possession. The promise was unconditional. God confirmed it at least 55 times with an oath, and stated at least 12 times that the covenant was everlasting.</p>\n<p>God did bring the Israelites into the Promised Land forty years after the Exodus from Egypt. Israel reached the peak of her power some 500 years later under King Solomon.</p>\n<p>Israel entered the Promised Land, and hundreds of years later, under King Solomon, they occupied a large part, but not all, of the territory which God had promised to them. Israel was required to obey the Law of Moses, and, when they failed, God thrust them out of the land. However, God’s promise that they will inherit the land still stands. We see the Jews being brought back to the Promised Land in our day. We expect that God’s word will be fulfilled, and that they will enter their full inheritance. The next question is: What are the boundaries of the Promised Land as described in the Bible?</p>\n<p>Scripture indicates that the boundaries of the Promised Land are as follows:</p>\n<p><strong>NORTH</strong></p>\n<p>From the Great Sea, or Western Sea – other names for the Mediterranean – through what is Lebanon and Syria today, to the Euphrates River in the north (Genesis 15:18; Deuteronomy 11:24; Ezekiel 47:17; Joshua 1:4).</p>\n<p><strong>SOUTH</strong></p>\n<p>From the Red Sea, in the region of Eilat today, to the Sea of the Philistines, which would be the Mediterranean Sea near Gaza. This southern line was to a point called the River of Egypt, or the wadi of Egypt on the Great Sea – another name for the Mediterranean. (Exodus 23:31; Ezekiel 47:19; Genesis 15:18).</p>\n<p><strong>EAST</strong></p>\n<p>From the Euphrates River in the north, extending south, past Damascus, along the slopes on the eastern side of the Sea of Kinnereth, what we know as the Golan Heights today. The Kinnereth is also called the Eastern Sea in Scripture, and is what we know as the Sea of Galilee.</p>\n<p>The Jordan River rises in the mountains of Lebanon and runs south to the Sea of Galilee. At the southern end of the Sea of Galilee the Jordan River flows out and along the Jordan Valley to enter the Dead Sea. The eastern side of the Jordan River, south of the Golan Heights, represents the boundary of the Promised Land (Numbers 34:11-12; Ezekiel 47:18).</p>\n<p><strong>WEST</strong></p>\n<p>The coastline of the Mediterranean – called, in those days, the Great Sea (Numbers 34:6; Ezekiel 47:20).</p>\n<p>Although some of the geographical reference points mentioned in Scripture are difficult for us to identify, God knows the full area into which He is going to bring Israel. We know enough to be sure that Israel is not in her full inheritance yet.</p>\n<p>The Bible refers to significant points that we can identify – the Sea of Kinnereth, being the Sea of Galilee; the Salt Sea, being the Dead Sea; and places such as Gaza and Sidon, where there is no doubt about the ancient location. Archaeology has given us proof.</p>\n<p>What we can say is that the Promised Land stretches from the Red Sea, around Eilat, as a southern boundary, to the Mediterranean at a point south of Gaza, and extending from there up the coastline at least as far north as Sidon in Lebanon, to form the western boundary, then north to the Euphrates River, to form the northern boundary, and down the line of the Jordan River, to form the eastern boundary.</p>\n<p>This area would encompass the Palestinian territories of the West Bank, also called Judea, and Samaria, and Gaza. Certain world leaders may be looking for the establishment of a Palestinian state separate from Israel, but God’s Word makes a different judgment. God says that this is the land that He promised to the descendants of Abraham, Isaac, and Jacob.</p>\n<p>Scripture shows that God has a dispute with those who are involved in “dividing up My land” (Joel 3:1-2).</p>\n<p><strong>A Kingdom of Priests</strong></p>\n<p>The nation of Israel, which God established in Abraham, would become a blessing to all the other nations on earth created by God, for Israel was to be a Kingdom of Priests. “And ye shall be unto me a kingdom of priests, and a holy nation. These are the words which thou shalt speak unto the children of Israel” (Exodus 19:6).</p>\n<p>The High Priest, in this kingdom of priests is the King Himself, Jesus Christ, the Righteous one. “For this Melchisedec, king of Salem, priest of the most high God, who met Abraham returning from the slaughter of the kings, and blessed him” (Heb. 7:1).</p>\n<p><strong>Repetitive Sin in the Seed of Abraham</strong></p>\n<p>The development of the family of Abraham is the focus of attention in Genesis 12 – 50.</p>\n<p><strong>An Unfolding Narrative</strong></p>\n<ul>\n<li>Abraham: Genesis 12 – 25a</li>\n<li>Isaac and Jacob: Genesis 24b – 36</li>\n<li>Jacob’s Twelve Sons: Genesis 37 – 50</li>\n</ul>\n<p>There is a cyclical narrative in the lives of the descendants of Abraham of bad decisions, being followed by God’s faithfulness. The tragedy is that one generation never learns enough from the previous generation to stop sinning.</p>\n<p>In matters of machinery and education, one generation builds upon another. However, in the matter of morality, righteousness is never passed on. One reason for this is that evil is militant. Another reason is that sin is a mutant, and is able to change its form. There are depths to sin that are deeper still. If the essence of sin remains static, the variant expressions of evil are legendary. The sin saturated imagination can be very creative, but always self-destructive, and other destructive. An eternity in hell will not arrest, or quench, the insatiable lusts that drive sin.</p>\n<p> <strong>The Bad Decisions of Abraham Genesis 12 and 20</strong></p>\n<p>The ability to make a bad decision is reflected in the life of Abraham. On two occasions, Abraham, the man of faith, lost his confidence in God, and thought it expedient to lie. In Genesis 12:10-20, Abraham instructs Sarai to tell Pharaoh that she is his sister. In Genesis 20:1-18, Abraham tells king Abimelech that Sarah is his sister. Because one sin leads to another, the <em>lies</em> Abraham told about Sara were a <em>betrayal</em> of her, and placed her in a position to be sexually abused.</p>\n<p><strong>Ishmael and Isaac Genesis 16</strong></p>\n<p>If lying was not bad enough, Abraham agreed to have a surrogate son by one of his servants, Hagar. The child born of this unholy union has influenced world history down through the centuries, to the present hour. The descendants of Ishmael, the Arabs, hate the Jews, and vice versa. There is blood in the sand in the Middle East because Abraham tried to circumvent the plan of God. Nevertheless, the Lord proved Himself faithful. Abraham and Sarah did have a son, and they called him Isaac. Study Genesis 17:1-22; 18:1-15; 21:1-8</p>\n<p><strong>Circumcision, the Mark of the Covenant</strong></p>\n<p>The mark of the Covenant the Lord made with Abraham was to be circumcision. “And God said unto Abraham, Thou shalt keep my covenant therefore, thou, and thy seed after thee in their generations. 10 This is my covenant, which ye shall keep, between me and you and thy seed after thee; Every man child among you shall be circumcised. 11 And ye shall circumcise the flesh of your foreskin; and it shall be a token of the covenant betwixt me and you” (Gen. 17:9-11).</p>\n<p>Why did God require circumcision as the sign of the Covenant? The honest answer is this: no one knows. It has been suggested that the act of circumcision was demanded because it requires the shedding of blood. In Leviticus we find that “the life of the flesh is in the blood”, and it is “blood that makes an atonement for the soul. “For the life of the flesh is in the blood: and I have given it to you upon the altar to make an atonement for your souls: for it is the blood that maketh an atonement for the soul” (Lev. 17:11).</p>\n<p>The blood of circumcision opened the way of entrance into the Abrahamic Covenant, and thereby became a type of the way individuals enter into the New Covenant, through the blood of Christ.  “And almost all things are by the law purged with blood; and without shedding of blood is no remission” (Heb. 9:22).</p>\n<p><strong>Esau and Jacob Genesis 25b – 36</strong></p>\n<p>With the death of Abraham at the age of 175, which is said to be “a good old age” (Gen. 25:8), attention is turned in Genesis to Isaac, and his sons, Esau and Jacob. Even while the children were being birthed, Jacob lived up to his name, “supplanter” (v. 26).</p>\n<p><strong>Person, Age at Death</strong></p>\n<p>Terah, 205: Genesis 11:32<br>Sarah, 127: Genesis 23:1<br>Abraham, 175: Genesis 15:15; 25:7-8<br>Ishmael, 137: Genesis 25:17<br>Isaac, 180: Genesis 35:28      </p>\n<p>As a gifted supplanter and deceiver, Jacob found a way to get Esau to relinquish his birthright. Then, Jacob deceived his old, blind father, Isaac, to give him the blessing before fleeing to dwell in Haran in Mesopotamia. Study Genesis 27:1 – 28:9</p>\n<p>Though he loved Rachel, Jacob would take her sister Leah as a wife, and then bed two female servants who would produce, collectively, twelve sons.  These sons would form the 12 tribes of Israel.</p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-10344 jetpack-lazy-image jetpack-lazy-image--handled\"><img loading=\"lazy\"  src=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?resize=640%2C715&amp;ssl=1\" data-is-external-image=\"true\"  sizes=\"(max-width: 640px) 100vw, 640px\" srcset=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?resize=917%2C1024&amp;ssl=1 917w, https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?resize=269%2C300&amp;ssl=1 269w, https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?resize=134%2C150&amp;ssl=1 134w, https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?resize=768%2C857&amp;ssl=1 768w, https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?w=1075&amp;ssl=1 1075w\" alt=\"\" width=\"640\" height=\"715\" data-attachment-id=\"10344\" data-permalink=\"https://stanmurrell.org/2021/11/10/an-overview-of-genesis/gen3/\" data-orig-file=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?fit=1075%2C1200&amp;ssl=1\" data-orig-size=\"1075,1200\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Gen3\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?fit=269%2C300&amp;ssl=1\" data-large-file=\"https://i1.wp.com/stanmurrell.org/wp-content/uploads/2021/11/Gen3.png?fit=640%2C715&amp;ssl=1\" data-recalc-dims=\"1\" data-lazy-loaded=\"1\"></figure></figure>\n<p><strong>Reaping What is Sown</strong></p>\n<p>In spite of his questionable behavior, the Lord honored Jacob according to His own principle of grace. Jacob prospered in Haran, even when his uncle Laban deceived him, and cheated him out of many years of wages. Study Genesis 28:10 – 33:20; 35:1-12</p>\n<p>It was a different man who returned to his homeland after an absence of twenty years. Jacob is a humble man, willing to make restitution to his brother Esau. He is also a desperate man, desperate enough to wrestle with the Angel of the Lord until he is blessed saying, “I will not let thee go, except thou bless me.” Study Genesis 32:3-32</p>\n<p><strong>A New Name</strong></p>\n<p>God honored Jacob’s determination, and passed the blessing of Abraham on to Jacob. Then, the Lord renamed Jacob, Israel (Heb. “wrestles with God”). “And he said unto him, What is thy name? And he said, Jacob. 28 And he said, Thy name shall be called no more Jacob, but Israel: for as a prince hast thou power with God and with men, and hast prevailed” (Gen. 32:27-28).</p>\n<p><strong>The Sons of Jacob Genesis 37 – 50</strong></p>\n<p>In the closing chapters of Genesis, the sons of Jacob are prominent. Of particular importance is the story of Joseph being love by Jacob, and hated by his jealous brothers who sell him into slavery. In the providence of God, Joseph survives many great challenges to become a powerful man in the court of Pharaoh. Joseph was able to save the nation of Egypt, and rescue his family from famine. What his brothers meant for evil, God meant for good. Study Genesis 37 – 46</p>\n<p>The Book of Genesis ends with the great testimony that God is faithful. God rules in the affairs of men. One day a King will come who will command the obedience of all the nations on earth. “The scepter shall not depart from Judah, nor a lawgiver from between his feet, until Shiloh come; and unto him shall the gathering of the people be” (Gen 49:10).</p>\n<p><strong>Lesson to Learn from Genesis</strong></p>\n<p><em>Made in the Image of God</em></p>\n<p>When the Bible says that men and women are made in the image of God, the reference is their character. An image resembles, and represents someone, or something. To say that humans are made in the image of God is to say that men and women are like God in some way.</p>\n<p>To be specific, men and women are like God in moral qualities, such as a desire for righteousness (Eph. 4:24), ethical perfection (Matt. 5:48), personal purity (1 John 3:2, 9), love (1 John 3:16-18), forgiveness (Matt. 6:14; Col. 3:13); humility (Phil. 2:3-11), holiness (Eph. 4:24), and knowledge (Col. 3:10). Men and women are like God in exercising their will, in the power to reason (Isaiah 1:18), and in the power to procreate.</p>\n<p>The image of God in man is not an exact image (Isaiah 55:9), but it is real, for to men and women is given the power to exercise dominion over a small part of God’s creation. “Thou madest him to have dominion over the works of thy hands; thou hast put all things under his feet: 7 All sheep and oxen, yea, and the beasts of the field; 8 The fowl of the air, and the fish of the sea, and whatsoever passeth through the paths of the seas” (Psalm 8:6-8).</p>\n<p><em>The Origin of Sin</em></p>\n<p>In the Garden of Eden, Adam and Eve were given a choice. They could obey God by not eating of forbidden fruit, or, they could try to seize autonomy, and define good and evil themselves. Acting as a Federal Representative of the Human Race, Adam consciously rebelled against God and ate the forbidden fruit. The immediate result was death. “Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned” (Rom. 5:12). The only way to reverse the curse is to go to another tree, at Calvary, and embrace Jesus Christ as Lord and Savior, as the Roman centurion did so long ago. “Now when the centurion, and they that were with him, watching Jesus, saw the earthquake, and those things that were done, they feared greatly, saying, Truly this was the Son of God” (Matt. 27:54).</p>\n<p>The rebellion of Adam against God was preceded by the rebellion of Satan against the Most High, for Lucifer asserted his own will against the Lord five times. </p>\n<p>“How art thou fallen from heaven, O Lucifer, son of the morning! how art thou cut down to the ground, which didst weaken the nations! 13 For thou hast said in thine heart, I will ascend into heaven, I will exalt my throne above the stars of God: I will sit also upon the mount of the congregation, in the sides of the north: 14 I will ascend above the heights of the clouds; I will be like the Most High.15 Yet thou shalt be brought down to hell, to the sides of the pit” (Isaiah 14:12-15).</p>\n<p><em>Wanting Something More</em></p>\n<p>When the serpent appears in Genesis 3, there is no introduction. What is introduced is the idea that Adam and Eve were not made in the image of God, but could be. It is this idea of wanting something more that is the key to understanding how Satan gets the advantage over people.</p>\n<p><em>Consider</em></p>\n<p>During the 1960 presidential election, Senator John F. Kennedy built his political campaign around the idea of “something more.” “Life is good in America,” he acknowledged, “but under my administration, there is something more to be enjoyed. We can do better.” That was the essence of his message. And, it worked. The idea of wanting “something more”, is powerful. It was persuasive in the Garden of Eden, and it was persuasive in a presidential campaign.</p>\n<p><em>Sin Brings Calamity</em></p>\n<p>There are always casualties in sin. When Adam and Eve sinned against God, they immediately found they no longer trusted each other. Hiding their shame with fig leaves, the man turned against the woman, who turned against the serpent. Worse, the intimacy they enjoyed with the Lord was gone.</p>\n<p>Because of sin, every facet of life is accompanied by sadness, sorrow, and grief. Women must bring forth children in pain and great agony. Men must work harder, and by the sweat of their brow. The children often grow up to hate mom and dad, or one another, as Cain hated Able, and murdered him.</p>\n<p><em>Marriage is Not to be Polluted</em></p>\n<p>Because of sin, marriage itself has been polluted. There is polygamy, instituted by Lamech, an ungodly descendant of Cain. Lamech married two wives, and committed murder, just like his great-great-great grandfather (Gen. 4:16-18). Today, the institution of marriage is assaulted by abortion, and the homosexual agenda.</p>\n<p><em>Scripture is Not to be Sensationalized</em></p>\n<p>Care must be taken not to sensationalize Scripture reflected in the idea that fallen angels cohabited with women on earth to create a race of giants, the Nephilim (Gen. 6:1-4). Just because proud individuals claim they descended from the gods, does not justify the Church passing on unworthy narratives.</p>\n<p><em>The Sovereignty of God will Overrule Man</em></p>\n<p>The promises God made to Abram is a reflection of the Lord’s sovereignty overruling the generation that had gathered at the Tower of Babel (Gen. 11). At Babel, a spirit of rebellion motivated the people to settle into a large city and build a tower. The people did not want to be scattered (11:4), despite the known will of God that the earth is to be replenished. “So, the Lord scattered them abroad from thence upon the face of all the earth: and they left off to build the city” (Gen. 11:8). The lesson is clear. God knows how to disrupt the imagination, and determinations of man in order that His will be done on earth as it is in heaven.</p>\n<p><em>The Church is a Kingdom of Priests</em></p>\n<p>The commitment by God that Israel would be a kingdom of priests finds ultimate fulfillment in the Church. “But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light” (1 Peter 2:9).</p>\n<p><em>The Fallacy of Nostalgia  </em></p>\n<p>Every generation without exception tends to look to the past as a romantic past. People talk about the “good ole days” until they are reminded of the problems of the preceding generation. There may be brief periods of peace and prosperity for some, but for most people, life is a vale of tears. “Yet man is born unto trouble, as the sparks fly upward” (Job 5:7). This shall remain true until Jesus comes and there is a new heaven and a new earth of righteousness (2 Peter 3:13).</p>\n<p><em>Pray for a New Heart</em></p>\n<p>Because sin is insatiable, a person who wishes to be fundamentally and forever different must ask God for a new heart. Pray now, this prayer. “</p>\n<p>“Create in me a clean heart, O God; and renew a right spirit within me. Cast me not away from thy presence; and take not thy holy spirit from me. Restore unto me the joy of thy salvation; and uphold me with thy free spirit. Then will I teach transgressors thy ways; and sinners shall be converted unto thee. Deliver me from blood-guiltiness, O God, thou God of my salvation: and my tongue shall sing aloud of thy righteousness. O Lord, open thou my lips; and my mouth shall shew forth thy praise. For thou desirest not sacrifice; else would I give it: thou delightest not in burnt offering. The sacrifices of God are a broken spirit: a broken and a contrite heart, O God, thou wilt not despise. Do good in thy good pleasure unto Zion: build thou the walls of Jerusalem. Then shalt thou be pleased with the sacrifices of righteousness, with burnt offering and whole burnt offering: then shall they offer bullocks upon thine altar” (Psalm 51:10-19).</p>\n<p> </p>\n</div>\n</div>\n</div>",
            "author": {
                "name": "1tritagonist"
            },
            "tags": [
            ],
            "date_published": "2021-12-05T13:42:08+08:00",
            "date_modified": "2021-12-05T14:06:42+08:00"
        },
        {
            "id": "https://prenticepoint.github.io/tritavlogcast/welcome-to-the-tritavlogcast.html",
            "url": "https://prenticepoint.github.io/tritavlogcast/welcome-to-the-tritavlogcast.html",
            "title": "Welcome to the TritaVlogCast",
            "summary": " A FILIPINO CONFESSIONAL PARTICULAR BAPTIST VLOGCAST THAT TALKS ABOUT CHRISTIANITY, CULTURE, CONCERNS MADE RELEVANT, RELATABLE FROM THE CONFESSIONAL-COVENANTAL PERSPECTIVE. Social media accounts&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/YIVv_jl-X3A\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h6 class=\"align-center\">A FILIPINO CONFESSIONAL PARTICULAR BAPTIST VLOGCAST THAT TALKS ABOUT CHRISTIANITY, CULTURE, CONCERNS MADE RELEVANT, RELATABLE FROM THE CONFESSIONAL-COVENANTAL PERSPECTIVE.</h6>\n<p> </p>\n<h4 class=\"align-center\">THINK CONFESSIONALLY, LIVE COVENANTALLY.</h4>\n<h4 class=\"align-center\">CHRIST IS OUR LIFE: OUR LIFE IN A COVENANTAL AFFINITY.</h4>\n<p> </p>\n<p>Social media accounts and website, check out here: <strong><a href=\"#INTERNAL_LINK#/post/null\">https://plu.us/prenticepoint</a></strong></p>\n<p> </p>",
            "author": {
                "name": "1tritagonist"
            },
            "tags": [
            ],
            "date_published": "2021-06-03T10:00:00+08:00",
            "date_modified": "2021-12-05T01:55:24+08:00"
        },
        {
            "id": "https://prenticepoint.github.io/tritavlogcast/here-is-the-beginning.html",
            "url": "https://prenticepoint.github.io/tritavlogcast/here-is-the-beginning.html",
            "title": "Here is the beginning...",
            "summary": "Lahat ay may simulain. Sa mga oras na ito. Aking sinisimulan ang pagbuo ng mga reflections ko hinggil sa aking pagkatuto (Kahit hindi&hellip;",
            "content_html": "<p>Lahat ay may simulain. Sa mga oras na ito. Aking sinisimulan ang pagbuo ng mga reflections ko hinggil sa aking pagkatuto (Kahit hindi pa ito ganap na husto), ang mahaba-habang paglalakbay sa kaalaman at pagsasagawa [pag-aapply sa buhay pananampalataya] ng mga katotohanan at blessings na siyang idinulot at patuloy na idudulot ng Covenant Theology.</p>\n<p><strong>Pagkamangha at Biyayang Laan ng Covenant Theology</strong></p>\n<p>Kung sa tinging ng marami ay ironic. Ang totoo hindi ko alam paano simulan ang paksa na ito. Pero sinisimulan ko sa pagsusulat nito, nakakatuwa man sabihin. Gaya sa pagbuo ng isang puzzle. Marami pa akong dapat matutunan. Paltan o tanggaling mga kamalian (errors), maging ang mga inconsistent na knowledge regards sa theology at prexies [nuon akala ko at pinaninindigang kong tama para akin]. Papanatilihin ang mga consistent at pagtibayin ito. Sa pamamagitan ng buo at ganap na inscripturated revealed Word of God [Ang Holy Bible]. Bakit ko nagsabing gaya ng pagbuo ng puzzle? Maari marami sa atin, ang nakakita na ng puzzle at nakapaglaruan na nito. Natatandaan ko nung bata ako. Kasama ko ang aking ama noon. Somewhere in Manila iyon, napadaan kami nuon sa isang crowded na lugar. Natural bilang bata nung mga panahon, aking inililibot ang aking paningin. Natatandaan ko nung nagpabili ako sa tatay ko ng puzzle, dahil nakita ko ang may mga laruang binebenta . Nakitang ko maganda yung puzzle. Nakalarawan dun ay si Superman. Anong ibig kong ipahiwatig dito? So, alam ko na kung ano ang kabuan ng puzzle. Buo at complete yung puzzle na ang larawan ay si Superman. Ganun din sa buhay pananampalataya ko. Kung hindi dahil sa biyaya ng Diyos, hindi para makarating ako sa kaaalaman at manamplataya sa Panginoong Jesus......</p>\n<p>Dito tayo matutulungan ng Covenant Theology. Ang makita at malaman ang whole purpose o ang revealed will of God. Ang Banal na Kasulatan ang tinatawag na covenantal revelation ng Diyos. Mula umpisa hanggang dulo ay may pagkakaisa at walang kamalian o lalong hindi maaring magkamali. Ang Covenant Theology ay tinatawag na “The Whole System of the Divine Grace”.</p>\n<p>Bakit? Mula Creation hanggang Consummation. Progresibong inihayag ng Diyos ang Kanyang sarili. Sa kapahayagang ito, tinatawag na “Condescension” o kusang loob na inabot ng Diyos ang tao. Bagamat napakalayo ang agwat ng Diyos at ng tao. Ang layong ito ay hindi spatial kundi ang Diyos ay Diyos at ang tao ay tao. Ang paghahayag ng Diyos sa atin ay masasabi natin na isang biyaya. Totoo na both judgment at redemption ay naghahayag ng glory of God. Sa judgment, ipinapakita ang justice ng Diyos. Sa redemption, ipinapakita ang grace ng Diyos. Sa paraan ng covenant, ipinahayag ng Diyos ang Kanyang sarili at ang Kanyang ninanais sa Kanyang mga sangnilikha. Nang nilikha ng Diyos ang tao at inilagay sa garden of Eden. May mga nasasabi o maraming may ganitong paniniwala na kaya nilikha ng Diyos ang tao ay upang hindi S’ya malungkot. Isa itong malaking kamalian, dahil kayang mabuhay ng Diyos na walang tao. Kaya ng Diyos na magkaroon ng kasiyahan sa Kanyang sarili. Dahil ang Diyos na’to ay Triune God. Ang Diyos Ama, Diyos Anak at Diyos Espiritu Santo ay may Eternal at strong fellowships sa isa’t isa. Kaya papaanong malulungkot ang Diyos kundi lilikhain ang tao. Isang biyaya ito. Malaking karangalan at pribileyo na tayong mga tao ay reflection ng Kanyang glory in some ways. Ngunit ang karangalan at pribileyong ito ay nadungisan at nawala ng dahil sa kasalanan.</p>\n<p>Ang Covenant Theology ay consistently founded on the Scriptures at Christ-centered. Hindi gaya ng Dispensational Theology ay seed bed ng human reasonings at naka-focus sa Israel. Hindi tayo against sa Israel o mga Jewish people. Pero ang pini-pinpoint natin dito. Dapat na ang lahat ng fulfillment ay nasa Panginoong Jesus.</p>\n<p> </p>\n<p>Sa Covenant Theology, nagiging consistent ang lahat ng branches ng kaalamang pang theology at pag-aapply ng mga ito sa buhay pananampalataya ng isang Christian.</p>\n<p>Mula Genesis hanggang Revelation ay may iisa at pinakauna sa lahat, “Ang Diyos”. Ngayon papaano natin makikilala o magkakaroon ng ganap na pagkakilala sa Diyos na ito. Makikilala lamang natin ang Diyos. Kung pahihintulutan ng Diyos na ihayag ang Kanyang sarili sa atin. Ngunit ito’y kusang loob na ginawan ng Diyos, ang ihahayag Kanyang sarili sa pamamaraan ng covenant. The more na inihahayag ng Diyos ang Kanyang sarili. The more na nahahayag ang Kanyang kaluwalhatian. Sa kaluwalhatian N’ya, ito’y nagdudulot ng kabutihan sa Kanyang mga nilikha [lalo na sa Kanyang reasonable creatures ang tao].</p>\n<p>Pinapakita ng Covenant Theology ang consistency ng Diyos, sa Kanyang Glory, sa Kanyang Grace, sa Kanyang Gospel.</p>\n<p>Consistent ang Covenant Theology sa kanyang whole interpretation, pagkat sa ganun din paraan kung papaano i-interpret ng Scriptures ang kanyang sarili.</p>\n<p>Consistent ang Doctrine of Grace (commonly known by others na Calvinism) sa Covenant Theology.</p>\n<p>Consistent ang Five Sola’s sa Covenant Theology.</p>\n<p>Consistent ang Covenant Theology sa paghubog at gawin matatag ang iglesia at ang pagmi-mission nito. Hindi lang inihahayag o itinuturo ng Covenant Theology ang maraming kaalaman tungkol sa Diyos at mamuhay na ayon sa Kanyang kalooban, kundi ipinapakita din nito at nahahayag din sa iglesia ng Panginoon ang spirit of reformation. Ang mga katagang “Coram Deo” at “Semper Reformanda ay consistent sa Covenant Theology.</p>\n<p>Consistent ang Covenant Theology sa Scriptures, bagamat maraming nag-aadhere dito. Sa mga nag-aadhere dito, nagkakaiba-iba lang sa kani-kanilang application. Ngunit hindi sa whole interpretation ng Scriptures. Kaya dito pumapasok ang Coram Deo at Semper Reformanda. Kaya Hindi rin natin maiwawaglit na ang Covenant Theology ay tinatawag din sa ibang pangalan, ” Reformed Theology “.</p>\n<p> </p>\n<p>Kagaya ng una kong nasabi na binubuo ko pa o ilagay ko sa ganitong sa pangungusap. Dahil sa Biyaya ng Diyos, inilagay N’ya ako sa paglalakbay na’to. Marami pa akong dapat matutunan, marami pa akong dapat maranasan, marami pa akong dapat gawin para sa Kanyang kaharian. Sa paglalakbay kong ito, sabay natin i-explore at sabay natin matutunan maraming bagay ukol sa Diyos. Lalo na sa Covenant Theology. Papaano itong gawin practical sa kaalaman at pamumuhay sa pang- araw araw na buhay Cristiano. Ang aking panalangin at hiling na mai-enunciates ko ang dakilang katotohanan ng Salita ng Diyos kung loobin ng Diyos -marami ang ma-evangelize [maabot ng Gopel], ma-exhort at ma-edify. Sa pamamagitan ng pagpapahayag ko at paggawa ng mga reading articles, pagrereblog, reviews sa maraming bagay (books, articles, etc…), sa paggawa ng mga content materials gaya ng podcast o ng vlogcast na pwedeng i-access ng free ng marami na walang pag-aalinlangan dahil sa financial obligation [Hindi ko ini-encourage o dini-discourage na maging bahagi kayo ng aking hadkain. Ito’y kung inilagay sa puso o binigyan kayo ng kakayanan ng Diyos na gawin ang mga ito.] Kung sa palagay ninyo na pinagpala kayo sa munting kakayanan meron ako. Maaring ninyong i-share ang mga matatagpuan nyo rito sa iba pa. Upang sa gayon maging blessing din sa kanila ang mga meron dito.</p>\n<p>Maraming salamat sa pagdrop by ninyo sa <strong><a rel=\"noreferrer noopener\" href=\"http://www.tritavlogcast.cf\" target=\"_blank\">TritaVlogCast</a></strong><strong>,</strong></p>\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>A Filipino Particular Baptist vlogcast that talks about Christianity, Culture, Concerns made Relevant, Relatable from the Confessional-Covenantal perspective.</p>\n<p> </p>\n<p>Think Confessionally, Live Covenantally.</p>\n<p> </p>\n<p>Christ is Our Life: Our Life in a Covenantal Affinity.</p>\n<cite><a rel=\"noreferrer noopener\" href=\"https://www.tritavlogcast.cf/explore/about/\" target=\"_blank\">About TritaVlogCast</a></cite></blockquote>\n</figure>\n<p><br><br></p>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td class=\"align-center\" style=\"width: 33.3333%;\"><strong><a href=\"https://prenticepoint.github.io/tritavlogcast/learn-more.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Learn More</a></strong></td>\n<td class=\"align-center\" style=\"width: 33.3333%;\"><strong><a href=\"https://prenticepoint.github.io/tritavlogcast/support-our-cause.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Support Our Cause</a></strong></td>\n<td class=\"align-center\" style=\"width: 33.3333%;\"><strong><a href=\"https://prenticepoint.github.io/tritavlogcast/ask-a-question.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Ask a Question</a></strong></td>\n</tr>\n</tbody>\n</table>",
            "image": "https://prenticepoint.github.io/tritavlogcast/media/posts/21/ThePrenticePoint1.png",
            "author": {
                "name": "1tritagonist"
            },
            "tags": [
                   "christianity",
                   "TritaVlogCast",
                   "Particular Baptist",
                   "Faith",
                   "Covenantal",
                   "Covenant",
                   "Confessional",
                   "1689 Baptist Confession of Faith"
            ],
            "date_published": "2021-06-01T23:18:16+08:00",
            "date_modified": "2021-12-05T13:13:48+08:00"
        },
        {
            "id": "https://prenticepoint.github.io/tritavlogcast/ang-probidensya-ng-dios-at-ang-covid-19.html",
            "url": "https://prenticepoint.github.io/tritavlogcast/ang-probidensya-ng-dios-at-ang-covid-19.html",
            "title": "Ang Probidensya ng Diyos at ang CoVid 19",
            "summary": " The Lord is righteous in all his ways and faithful in all his acts. Psalms 145:17 CSB Nadulot ng pagkatakot sa maraming&hellip;",
            "content_html": "<div class=\"entry-content\">\n<pre class=\"wp-block-verse has-text-align-center\">The Lord is righteous in all his ways and faithful in all his acts. <br>Psalms 145:17 CSB</pre>\n<p> </p>\n<p>Nadulot ng pagkatakot sa maraming Pilipino ang muling pagkakaroon ng ECQ. Hanggang ito ay naging MECQ, na ang dahilan ay lumulubong kaso ng sakit na’to. Napaulat sa balita na umabot ito sa more or less na <a rel=\"noreferrer noopener\" href=\"https://www.google.com/amp/outbreaknewstoday.com/philippines-reports-record-15k-plus-covid-19-cases-friday-57494/amp/\" target=\"_blank\">15,000 na napadagdag sa record cases nuong April 02, 2021</a>.</p>\n<p>Halos mahigit isang taon na, ng ito’y manalasa sa buong mundo. Hanggang ngayon nararanasan natin ang bagsik ng CoVid 19.</p>\n<p>Apektado ang ekonomiya ng bansa natin( at sa maraming bansa sa buong mundo), kalusugan, libangan ng maraming Pilipino, kahit  maging ang mga Cristiano ay apektado din.</p>\n<p>Kamakailan napanuod ko din ang mga ilang mga documentaries (bagaman last year pa ito ipinost)  sa YouTube ni <a rel=\"noreferrer noopener\" href=\"https://youtu.be/41z0nQ26Sy4\" target=\"_blank\">Atom Araullo</a> at ng <a rel=\"noreferrer noopener\" href=\"https://youtu.be/dxzsWjuXeiQ\" target=\"_blank\">TV5</a>, inilalahad nila ang timeline at karanasan ng maraming Pilipino at maging kalagayan ng bansa natin nuon. Ngayon nanatili pa rin tayo nasa ilalim ng pandemyang ito. Umaasa ang marami at kahit ang mga mananampalataya ay dumadalangin sa Diyos. Na ito’y lumipas o humupa na.</p>\n<p>Takot, kaguluhan, pananamantala, pagdududa, o paninisi. Ang mga nakikita, naririnig, napapanuod o nararanasan natin sa sitwasyong meron tayo ngayon.</p>\n<p>Ngunit kung ikukumpara natin ang CoVid 19 sa mga <a rel=\"noreferrer noopener\" href=\"https://www.mphonline.org/worst-pandemics-in-history/\" target=\"_blank\">naunang epidemic o pandemic sa kasaysayan</a>. Mas higit na nakakatakot, nakalulunos at higit na marami ang nagkakasakit at namamatay nuon.</p>\n<p>Makikita  din natin sa kasaysayan, na ang mga sinauna o naunang mga Cristiano. Nakaranas din ng mga outbreaks o pandemic gaya ng THE BLACK DEATH, PLAGUE OF JUSTINIAN, ANTONINE PLAGUE. Kaalinsabay pa ng mga yan ay ang mga persecution.</p>\n<p>Kahit ganun, patuloy silang umuusad sa pagsuong sa mga sakuna, kahirapan, kaguluhan ng lipunang kinabibilangan nila.</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h3>Bakit kaya?</h3>\n<p>Dahil ang sagot ay alam nila ang kahalagahan ng “Probidensya ng Diyos” sa buhay Cristiano, sa loob ng tahanan, sa lipunan, sa advancement ng kaharian ng Diyos.</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<p>May isang prominenteng cristiano ang nagsabi ng ganito,</p>\n<blockquote>\n<p>\"Ang kawalang kaalaman (ignorance) [pagiging ignorante] ng probidensya ay ang pinaka sanhi sa lahat ng mga pagdurusa;[at] ang pinakamataas na pagpapala ay nakasalalay sa kaalaman tungkol dito. ”<br><br>John Calvin</p>\n</blockquote>\n<p>Kaya ang mga naunang cristiano nalalaman nila ito. Sa katotohanang ito, ang Dakilang Diyos ay inihahayag Niya ang Kanyang patuloy na pagkilos at pagmamalasakit sa mga moral creatures [ang tao] Nya. Masama man o mabuti ay Kanyang pinipreserba at pinamamahalaan.</p>\n<p>Ngunit higit at natatangi ang mga gawa ng Diyos sa Kanyang mga hinirang. Iyon ay dahil sa Kanyang walang hanggang tipan.</p>\n<p>Sa mga gawa ng Probidensya ng Diyos, ang dulot nito sa kanila ay makasumpong ng kaaliwan at kalakasan sa mapagkalingang kamay ng Diyos.</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h3>Ano nga ba ang Probidensya ng Diyos?</h3>\n<p>Ayon sa 1966 Baptist Affirmation of Faith, The Doctrine of God 4.1</p>\n<p>Ang Diyos na Manlilikha, sa kanyang walang katapusang(infinite) kapangyarihan at karunungan, ay nagtaguyod at namamahala sa lahat ng mga nilalang at mga bagay sa pamamagitan ng kanyang pinaka matalino at banal na pangangalaga, ayon sa kanyang walang kamaliang (infallible) kaalaman at hindi nababago (unchangeable) na kalooban, sa kaluwalhatian ng kanyang hindi masusupil (invicible) at matuwid na hangarin.</p>\n<p>Ganito naman sinasabi sa Baptist Larger Catechism,</p>\n<p>Tanong 20: Ano ang mga gawa ng Probidensya ng Diyos?</p>\n<p>Sagot: Ang mga gawa ng Probidensya ng Diyos ay ang Kanyang pinaka (most) banal, matalino (wise), at makapangyarihang pag-iingat (preserving) at pamamahala sa lahat ng Kanyang mga nilalang at lahat ng kanilang mga aksyon [ukol,para] sa Kanyang sariling kaluwalhatian.</p>\n<p>Kung isusuma natin. Ang Probidensya ng Diyos ay natataguyod (sustains), nag-iingat (preserves) at  namamahala (governs) sa lahat ng kanyang mga nilikha at sa lahat ng kanilang mga aksyon. Na ang pinaka-tanging dahilan ay ang kanyang kaluwalhatian at matuwid na hangarin.</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h3>Some Scriptural verses on God’s Providence</h3>\n<p>Ang Scripture ay mayaman sa mga passages na nagsasabi tungkol sa mga gawa ng ‘Probidensya ng Diyos’. Ang mga ito ay halimbawa lang,</p>\n<p class=\"align-center\">“You are the Lord , you alone. You have made heaven, the heaven of heavens, with all their host, the earth and all that is on it, the seas and all that is in them; and you preserve all of them; and the host of heaven worships you.<br><br>Nehemiah 9:6 ESV</p>\n<p class=\"align-center\">For of a truth against thy holy child Jesus, whom thou hast anointed, both Herod, and Pontius Pilate, with the Gentiles, and the people of Israel, were gathered together, For to do whatsoever thy hand and thy counsel determined before to be done.<br>       <br>Acts 4:27–28. KJV</p>\n<p class=\"align-center\">“Men, why are you doing these things? We also are men, of like nature with you, and we bring you good news, that you should turn from these vain things to a living God, who made the heaven and the earth and the sea and all that is in them. In past generations he allowed all the nations to walk in their own ways. Yet he did not leave himself without witness, for he did good by giving you rains from heaven and fruitful seasons, satisfying your hearts with food and gladness.”<br><br>Acts 14:15‭-‬17 ESV</p>\n<p class=\"align-center\">Oh, the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how inscrutable his ways!  “For who has known the mind of the Lord, or who has been his counselor?”  “Or who has given a gift to him that he might be repaid?”  For from him and through him and to him are all things. To him be glory forever. Amen.<br><br>Romans 11:33‭-‬36 ESV</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h3>Fear not, God is in control</h3>\n<p>Hindi tayo nai-iba sa mga naunang Cristiano, na nakararanas ng sakit, problema, sakuna. Kahit alam natin ibang-iba ang panahon nila, statistics, medical knowledge at ang mga resources [physical needs o solutions] na meron sila upang makatugon sa present situation nila.</p>\n<p>Nagawa pa rin nilang makapamuhay ng may kasiguraduhan, at kasapatan sa pagluwalhati sa Diyos. Maipakita ang kanilang distinct identity. Na ibang-iba sa perspectives at priorities ng mundong ito.</p>\n<p>Kung lalagay sila sa panahon natin, makaka- cope up pa din sila. Lalo na accessible at advance na ang kaalaman, technologies at medical attainment ng panahon natin kaysa sa kanila. Natatakot tayong mamatay. Natural ang takot na nararamdaman natin. Ngunit higit natin katakutan ang winika ng Panginoong Jesus sa atin,</p>\n<p class=\"align-center\">Don’t fear those who kill the body but are not able to kill the soul; rather, fear him who is able to destroy both soul and body in hell.<br><br>Matthew 10:28 CSB</p>\n<p>Oo, nakakatakot ang CoVid 19. Pero higit na nakakatakot ang dulot ng Kasalanan. Isa na dito, ang kapahamakan sa impyerno. Ang hindi ang makapiling ang Diyos at ang poot Nya ay higit na lalong nakakatakot at karima-rimarim sa taong hiwalay sa Kanya. Iniisip kasi ng marami (kahit nuong unang panahon) na kapag may pandemya o sakuna, pinaparusahan ng Dios ang mga tao ng dahil sa kasalanan.</p>\n<p>Nung nakaraan taon din, may naiencounter ako na matandang babae. Napunta ang usapang namin sa pagputok ng Taal Volcano at ang dahilan na tinutukoy nya ay gaya ng sinauna at maging sa maraming tao sa ngayon. Pinaparusahan ng Diyos ang mga masasama at makasalanang tao. Sa isip ko napapailing na lang ako sa sinasabi ng matanda. Gayong nakikita ko sa kanyang ang pagiging self-righteous. Kabanalang pangsarili na hindi batay sa katwiran ng Diyos.</p>\n<p>Kung ganun ang kaisipang paiiralin, ibang Diyos ang sinasabi nila. Kung ganun ang Diyos, laging nagkakasala at talamak ang kasalanang ginagawa ng mga tao araw-araw. Malamang na araw-araw na nagpapadala ng parusa ang Diyos sa mga tao. Ngunit hindi ganun ang Diyos. Umaakma ang Diyos ayon sa kanyang Sarili na hindi maaring masaklawan ng mga nagbabagong nilalang (mutable beings).</p>\n<p>Hindi ang Diyos ang may dahilan.</p>\n<p>“Rather, disease and other causes of pain and suffering are part of this broken world infected with sin, and these terrors have no place in the new creation, when God will roll back the curse, wipe away every tear, and make all things new (<a href=\"https://www.esv.org/Rev.%2021%3A1%E2%80%934%3B%2022%3A3/\">Rev. 21:1–4; 22:3</a>; cf. <a href=\"https://www.esv.org/Isa.%2025%3A8/\">Isa. 25:8</a>)..” (<a rel=\"noreferrer noopener\" href=\"https://www.thegospelcoalition.org/article/theological-reflections-pandemic/\" target=\"_blank\">Theological Reflections on the Pandemic, Brian Tabb</a>)</p>\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>Sin is the ultimate pandemic, infecting every son of Adam and daughter of Eve (cf. <a class=\"esv-crossref-link\" rel=\"noreferrer noopener\" href=\"https://www.esv.org/Rom.%205%3A12/\" target=\"_blank\">Rom. 5:12</a>). Iain Campbell <a href=\"https://www.amazon.com/Christians-Pocket-Guide-Sin-Disease/dp/1781916470/?tag=thegospcoal-20\">writes</a>, “a deep, universal and fatal illness . . . . Its working is lethal and toxic, and we all carry the germ.” </p>\n<p> </p>\n<p>Calvin <a href=\"https://www.amazon.com/Calvin-Institutes-Christian-Religion-Set/dp/0664220282/?tag=thegospcoal-20\">puts it this way</a>:</p>\n<p>Innumerable are the evils that beset human life; innumerable, too, the deaths that threaten it. We need not go beyond ourselves: since our body is the receptacle of a thousand diseases—in fact holds within itself and fosters the causes of diseases—a man cannot go about unburdened by many forms of his own destruction. </p>\n<p> </p>\n<p>There is no political solution, scientific remedy, or educational program that can cure or contain the pandemic of human sin. Yet many, if not most, people do not recognize their cancerous condition or grasp its deadly diagnosis.</p>\n<cite><a rel=\"noreferrer noopener\" href=\"https://www.thegospelcoalition.org/article/theological-reflections-pandemic/\" target=\"_blank\">-THEOLOGICAL REFLECTIONS ON THE PANDEMIC, BRIAN TABB</a>, <a href=\"https://themelios.thegospelcoalition.org/\">THEMELIOS</a> 45.1 (APRIL 2020).</cite></blockquote>\n</figure>\n<p>Naniniwala ako na ang situation na mayroon tayo ngayon [naayon ito sa Kanyang divine permission] ay gawa ng Probidensya ng Diyos. Na dinadala tayo sa Ebanghelyo at sa pagluwalhati sa Soberanong Diyos. Kagaya sa mga naunang mga cristiano.</p>\n<p>Lahat ng bagay ay hindi nalilingid sa Diyos. Pagkat ito’y Kanyang pinapangasiwaan.</p>\n<p>Kaya makikita natin ang mga mahahalagang bagay na dapat natin matutunan at maging hamon para sa atin, ang buhay na may kapanatagan at kagalakan sa kamay ng mapagkalingang Diyos.</p>\n<p> </p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h3>Pagtanaw sa panahon nila…</h3>\n<p>Hindi pa dumarating ang Cristianismo, may isang kilala at bantog na historian at general na si Thucydides.</p>\n<p>Kanyang inilarawan ang isang salot sa Athens bandang 430 B.C.,</p>\n<p>“nahawahan sila sa pag-aalaga sa isa’t isa at namatay na parang mga tupa. At ito ang naging sanhi ng pinakamabigat na dami ng namamatay; sapagka’t kung, sa isang banda, sila ay pinigilan ng takot mula sa pagdalaw sa isa’t isa, ang mga maysakit ay namatay nang hindi inaalagaan, kung kaya’t maraming mga bahay ang naiwan na walang laman dahil sa kawalan ng sinumang gagawa ng pangangalaga; o kung, sa kabilang banda, binisita nila ang mga maysakit, namatay sila. . . nangamatay sila sa kalulunos na kalagayan. Ang mga katawan ng mga namamatay ay mga nakapatong sa isa’t isa, at ang mga taong nag-aagaw buhay ay gumulong-gulong sa mga lansangan at, sa kanilang pagnanasa ng tubig, malapit sa lahat ng mga bukal. Ang mga templo din, kung saan nila pinagsama ang kanilang mga sarili ay puno ng mga bangkay ng mga namatay sa kanila.” (Thucydides. History of the Peloponnesian War,  Volume I: Books 1-2.)</p>\n<p>Gaya ng paglalarawan ni Thucydides, ang mga salot sa sinaunang panahon ay hindi dapat binabalewa. Takot ang madalas na pumipigil sa mga tao mula sa pagbibigay ng anumang uri ng pagmamalasakit at pangangalaga sa mga nagdurusa. Na nagiging resulta sa kabuuang pagpapabaya sa mga lagay ng taong dinapuan ng sakit at hinahayaan ang katawan ng mga namatay sa isang tabi o san ito inabutan.</p>\n<p> </p>\n<p>Makikita natin na ang mga naunang cristiano sa kanilang aksyon sa gitna ng epidemya. Ang malasakit at pangangalaga ng mga Kristiyano para sa mga may sakit ay malinaw na iba at natatangi (distinct). Katulad ng isang magandang, halimbawa, sa panahon ni Cyprian. Ang outbreak ay tinawag na “Plague of Cyprian”. Nakakatuwa pero hindi galing sa kanya ang sakuna. Kundi ipinangalan lang sa kanya. Pagkat sa kanyang pag-uulat at pagmamalasakit sa maraming tao nuon (Christian o Non-Christian). <a rel=\"noreferrer noopener\" href=\"https://www.history.com/.amp/topics/world-war-i/1918-flu-pandemic\" target=\"_blank\">Katulad din sa Spanish Flu ng 1918, ang sakit ay hindi nanggaling sa Spain. Tanging ang Spain lang ang nagbalita ukol dito nuong May, 1918</a>.</p>\n<p>Si Cyprian ay isang obispo sa lungsod ng Carthage noong panahon ng pag-uusig ng mga Kristiyano sa Decian.</p>\n<p>Noong 252 A.D., may isang salot ang tumama sa lungsod, at muli ang reaksyon ng mga naninirahan ay gaya ng paglalarawan ni Thucydides – ang mga maysakit at namamatay ay napabayaan habang ang mga katawan ay nagsimulang nakatambak sa mga lansangan na walang maglibing sa kanila.</p>\n<p>Pinili ni Cyprian na huwag pansinin ang krisis at hinimok ang mga Kristiyano na ipaglingkod ang kanilang sariling buhay upang pangalagaan ang mga may sakit at namamatay.</p>\n<p>Mula sa mayaman, humingi siya ng pondo; mula sa mahirap ay humiling siya ng serbisyo.</p>\n<p>Inayos niya ang tugon ng Kristiyano at hinimok ang mga mananampalataya na huwag gumawa ng anumang pagkakaiba sa pagitan ng pagmamalasakit sa kapwa Kristiyano at pag-aalaga sa mga pagano.</p>\n<p>Ang lahat ay dapat tumanggap ng pangangalaga, maging ang mga aktibong umuusig sa iglesia.</p>\n<p>Ayon kay Dionysius, na nagsusulat mula sa Alexandria,</p>\n<p>” Karamihan sa ating mga kapatid na Kristiyano ay nagpakita ng walang katapusang pagmamahal at katapatan, na hindi sinisiraan ang kanilang sarili at iniisip lamang ang isa’t isa. Niwalang kabuluhan ang panganib, inako nila ang mga maysakit, tinutulungan ang nila bawat pangangailangan at naglilingkod sa sila kay Cristo. . . Higit pa, sa pag-aalaga at pagpapagaling sa iba pa, inilipat ang kanilang mga pagkamatay sa kanilang sarili at namatay sa kanilang lugar.” (Ecclesiastical History, Eusebius, 7:22)</p>\n<p>“Ang mga pagano ay ang eksaktong kabaligtaran. Itinulak nila ang mga may unang palatandaan ng sakit at tumakas mula sa kanilang pinakamamahal. Itinapon pa nila ang mga ito na kalahating patay sa mga kalsada at tinatrato ang mga hindi nalibing na bangkay tulad ng basura sa pag-asang maiiwasan ang salot ng kamatayan, na, sa lahat ng kanilang pagsisikap, mahirap na makatakas” ( Ecclesiastical History, Eusebius, 7:22).</p>\n<p>Para sa sinaunang mundo, ito’y kakaibang konsepto. Na pagmalasakitan at alagaan ang mga maysakit at namamatay. Lalo na ang mga lantarang umuusig sa kanila ay kanilang binibigyan ng pagkalinga. Nuong unang panahon, hindi normal ang mga gawing ito. Natural ang ganitong pilosopiyang, “Bat ko tutulungan ang mga umapi sa akin o ang aking mga kalaban ko.”, “Anong pakinabang ang makakamtam ko, kung mapapahamak naman ako.”, ” Mamatay na ang mga ‘yan, ano pa?”, Hayaan natin na iligtas sila ng mga diyus-diyosan.”</p>\n<p>Dito nangibabaw ang pananaw ng tunay na Cristianismo. Saan man lugar, sino man mga tao ang makasama o anumang pangyayari sa buhay. May Soberanong Diyos na naghahayag ng dakilang Probidensya Niya.</p>\n<p>Hindi lang ito limitado sa Plague of Cyprian, ang ganitong attitude ng mga Cristiano. Batid nilang may peligrong nakaabang sa kanilang mga buhay. Hindi sila pinanghihinaan ng loob, bagkus mayroon silang kongretong pagresponde. Kagaya ng isang epidemya na tumatagal mula 312-313 A.D. Ito’y inilarawan ni Eusebius,</p>\n<p>“Ang mga patotoo ng kasigasigan at ng kabanalan ng mga Kristiyano sa lahat ng mga bagay ay naging malinaw sa lahat ng mga pagano. Sapagkat sila lamang [mga Kristiyano] na nasa gitna ng mga nasabing sakit ay nagpakita ng kanilang pakikiramay at pagiging tao sa pamamagitan ng kanilang mga gawa. Araw-araw ang ilan ay nagpatuloy sa pag-aalaga at paglilibing sa mga patay, sapagkat maraming mga tao na walang nangangalaga sa kanila; ang iba ay tinipon sa iisang lugar ang mga pinaghirapan ng taggutom, sa buong lungsod, at binigyan ng tinapay silang lahat; Sa gayo’y ang bagay na ito ay napabalita sa lahat ng mga tao, at nabalita sa lahat ng mga tao, at niluwalhati nila ang Diyos ng mga Kristiyano. at, (sila’y) kumbinsido mismo sa kanilang mga sarili sa mga katotohanan, inihayag nila na ang mga ito lamang ang sadyang tunay na maka-Diyos at matuwid.” (Eusebius, Hist. Eccl. 9.8)</p>\n<p>Nabanggit din ni Eusebius ang mga kataga ni Dionysus ng Alexandria, tungkol sa salot noong 250 CE, na kapareho ring tala ng pagresponde ng mga Kristiyano nuon sa panahong kanyang isinasalarawan nya,</p>\n<p><br>“Ang [salot] ay hindi lumayo kahit sa amin, ngunit [ito’y] dumating laban sa mga pagano na may lakas… [Ang mga Kristiyano] ay walang takot na dinadalaw ang mga maysakit at patuloy na naglilingkod sa kanila, na pinaglilingkuran sila kay Cristo, masayang masayang lumisan sa buhay na ito kasama sila, na nahawahan ng pagdurusa ng iba,<br>at iginuhit ang karamdaman galing sa kanilang mga kapwa (kapitbahay) [tungo] sa kanilang [mga] sarili, at kusang-loob na kinukuha ang kanilang mga sakit. At marami, pagkatapos nilang alagaan ang karamdaman ng iba at ibalik ang kanilang kalusugan, sila mismo ay namatay, inililipat ang kanilang kamatayan sa kanilang [mga] sarili… ang pinakamagaling sa mga kapatid natin ay lumisan sa buhay sa ganitong paraan, ilang mga presbyter at diakono at ilan sa mga layko. … Ang ganitong uri ng kamatayan, na nagmula sa labis na kabanalan at matibay na pananampalataya, ay tila daan sa pagkamartir.” (Dionysus ng Alexandria, binanggit sa Eusebius, Hist. Eccl. 7.22,)</p>\n<p>Ayon sa din isang English classicist, ancient historian na si Robin James Lane Fox (1987, 591) nagbigay siya ng mga halimbawa kung paano ang naging attitude ng mga Kristiyano na nagdulot ito sa kaibahan sa mundo ng pagano. Noong 250s, ang mga pangkat ng mga Cristiano, hindi ang mga siyudad ng mga pagano, ang nagsagawa ng mga koleksyon upang matubos ang kanilang mga miyembro mula sa mga barbarong dumukot. Sa panahon ng pagkubkob sa Alexandria noong 262 CE (kasabay ng salot!), Ang dalawang pinuno ng Kristiyano ay nagsagawa upang iligtas ang maraming matanda at may mga karamdaman, kapwa mga Kristiyano man at mga pagano. Sa panahon ng matinding kagutuman noong 311–312 CE, ang mga mayayamang paganong donor, noong una ay nagbigay ngunit pagkatapos ay nagtago ng mga pondo ng kabuuang bigay, sa takot na sila ay maging mahirap. Sa kabilang banda, ang mga cristiano ay nag-alok ng huling ritwal sa mga namamatay at inilibing sila, at namamahagi ng tinapay sa lahat ng iba pa na naghihirap mula sa gutom.</p>\n<p>Maging ang isa sa mga paganong kritiko na si Minucius Felix ay may panunuyang tala hinggil sa mga Cristiano. Inilalahad nya ang mga kalagayan ng mga Cristiano, ngunit ito’y sarcastic:</p>\n<p>“Ang ilan sa inyo, ang higit sa kalahati… ay nangangailangan, dumaranas ng lamig, mula sa gutom at pagod. Ngunit ang inyong diyos pinapayagan ito, nagmamaang-maangan siya rito, hindi siya o hindi makatulong sa kanyang mga sariling tagasunod.… May pangarap kang postumo na immortalidad [magpatuloy ng walang hanggan kahit na namatay na], ngunit kapag niyugyog sa harap ng panganib, kapag inaapoy ka sa lagnat o nasaktan ka sa sakit. , hindi mo pa rin alintana ang tunay mong kalagayan? Hindi mo pa rin ba nakikilala ang tao mong kahinaan? Dukha,miserable, gusto mo man o hindi, mayroon patunay ng iyong sariling kahinaan, at hindi mo pa rin aminin. (Minucius Felix, Oktubre 12,)</p>\n<p>Dito makikita natin, na hindi sentro ang ating mga sarili. Kundi ang ating Panginoong Jesu-Cristo. Na syang higit na mahayag. Mahayag na sapat ang kanyang biyaya sa anumang circumstances ng buhay. Kaya sa mata ng mga kritiko o manlilibak sa tunay na cristianismo, katitisuran o kamangmangan ito. Sinundan nila ang yapak na iniwanan ng ating Panginoong Jesus. Ang buhay na lumalakad sa pagluwalti sa Diyos at may kapakinabangan sa lipunan tungo sa makalangit na kaganapan ng Kaharian ng Diyos.</p>\n<p>Sa kalagitnaan din ng ika-apat na siglo may isang paganong emperador, na kinamumuhian ang Kristiyanismo, na kanyang inilarawan ng mukha ng kanyang relihiyong ginagalawan at may himutok na pag-amin sa superiority ng pagkakawanggawa ng mga Kristiyano sa mga mahihirap at maysakit, nagsasabi ito ng may katibayan. Inihambing ni Julian ang kawanggawa ng mga Kristiyano sa kabiguan ng paganismo, na umaasa syang maitatag sa kagayang halaga sa muling pagbuhay nya ng paganismo. (tingnan ang Julian, Works 289A-293A; 424C; 429D; 453A).</p>\n<p>“Sapagka’t nangyari na ang mga mahihirap ay napapabayaan at hindi pinapansin ng mga pari, kung gayon sa palagay ko ang mga masasamang taga-Galilea [ibig sabihin, ang mga Kristiyano] ay sumunod sa katotohanang ito at inialay ang kanilang sarili sa pagkakawanggawa. At nakakuha sila ng pag-akyat sa pinakapangit ng kanilang mga gawa sa pamamagitan ng kredito na napanalunan nila para sa mga naturang gawi ”(Julian, Letter to a Priest 337,).</p>\n<p>Ayon kay Rodney Stark, isang sociologist na syang may akda ng “The Rise of Christianity: How the Obscure, Marginal Jesus Movement Became the Dominant Religious Force in the Western World in a Few Centuries”. Nagbigay sya ng magandang assessment sa cristianismo, bagaman nakita nya na ang paglaganap na Christianity ay ang pagmamalasakit o pagkakawanganggawa na ibang iba sa mga pagano. Ganito ang pagkasabi niya</p>\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>Christianity arose as a revitalization movement that arose in response to the misery, chaos, fear, and brutality of life in the urban Greco-Roman world.…</p>\n<p>Christianity revitalized life in Greco-Roman cities by providing new norms and new kinds of social relationships able to cope with many urgent urban problems. To cities filled with the homeless and impoverished,</p>\n<p>Christianity offered charity as well as hope. To cities filled with newcomers and strangers,</p>\n<p>Christianity offered an immediate basis for attachments. To cities filled with orphans and widows,</p>\n<p><br>Christianity provided a new and expanded sense of family. To cities torn by violent ethnic strife,</p>\n<p>Christianity offered a new basis for social solidarity. And to cities faced with epidemics, fires and earthquakes,</p>\n<p>Christianity offered nursing services.</p>\n<p> </p>\n<cite>-THE RISE OR CHRISTIANITY, CHAPTER 7, RODNEY STARK, 1996 BY PRINCETON UNIVERSITY PRESS</cite></blockquote>\n</figure>\n<p>Ang pinaka usual na nakikita ng maraming tao at dapat makita sa isang Cristiano ay ang pag-ibig. Gaya ng nakita ni Rodney Stark at kanyang ipinalagay na ito ang naging sanhi ng pag-angat ng Christianity sa western world.</p>\n<p>Ngunit hindi ito ang dahilan kundi ang Diyos na mapagbiyayang kumakalinga sa kanyang mga hinirang. Sa kabilang bahagi, natutuwa tayo na nakapagbigay influence ang cristianismo. Ngunit ang mga ito ay panglabas lamang, hindi ang pangloob na paggawa ng Espirito ng Diyos [ito’y hindi nawawalay sa kapahayagan ng Banal na Kasulatan] (<a rel=\"noreferrer noopener\" href=\"https://bible.com/bible/1713/act.8.4-25.CSB\" target=\"_blank\">Acts 8:4-25</a>). Sa isa pang bahagi, may kinalaman din dito ang Diyablo, na siyang kaaway ng Diyos. Kaya masasabi natin na naging dominanteng salitang ang Christianity sa buong mundo at maraming nag-aakalang sila ay bahagi ng Christianity (<a rel=\"noreferrer noopener\" href=\"https://bible.com/bible/1713/mat.13.24-30.CSB\" target=\"_blank\">Matthew 13:24‭-‬30</a>). Sa kabuuan katotohanan, ito ay bahagi ng mga gawa ng Probidensya ng Diyos.</p>\n<p> </p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h3>Practical Observations sa panahon nila at sa panahon natin na may pandemic ng CoVid.</h3>\n<p>Sadyang nakamamangha ang pagkilos ng Diyos sa kasaysayan. Umusbong ang kaalamang pangangalaga sa mga dinapuan ng sakit. Na ginagawa ngayon sa modern time natin. Ang pagbibigay ng agarang tulong sa mga nangangailangan. Ngunit nagsu-suffer man ang mga cristiano sa kamay ng mga umuusig sa kanila, may kagutuman man, o sakuma. Bahagi ng kanilang pagiging cristiano ang mensahe ng ebanghelyo. Mensahe ng kaligtasan sa taong lugmok sa kasalanan at ang mundong ginupo ng kasalanan. Hindi dapat mangamba, kundi manangan tayo na may kapanatagan sa Panginoong Diyos tulad ng mga naunang mga mananampalataya.</p>\n<p>1. To them, this is an honor and privilege to glorify God.</p>\n<p>Para sa mga naunang mga cristiano, ang Probidensya ng Diyos ay isang karangalan at pribiliheyo na luwalhatiim ang soberanong Diyos. Ang sakit, kaguluhan, sakuna ay dinulot ng kasalanan sa tao at sa mundong ginagalawan natin. Ang pagkakalikha sa tao [kay Adam] at sa lahat ng bagay ay nasa kaayusan. The more na inihahayag ng Diyos ang Kanyang sarili sa tao, ito’y nagdudulot ng kabutihan sa lahat ng Kanyang mga nilikha. Sa sariling paghahayag ng Diyos sa tao, nahahayag ang Kanyang glory. Marapat na tayo’y lumuwalhati sa Diyos na manlilikha natin</p>\n<p>Nabigo ang tao na luwalhatiin ang Diyos dahil pagkahulog nito sa kasalanan. Ngunit sa kahabagan at biyaya ng Diyos, hindi hinayaan ng Diyos ang taong makasalanan.</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<p>Bagkus ang Diyos na mapagbiyaya ay</p>\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>Isinasaalang-alang [ng Diyos] ang kawalan ng kakayahan ng tao bilang isang makasalanan [Bagaman ang Diyos ay may soberanong kalayaan sa pagpili],  ang Diyos, na parehas na matuwid at mapagbigay, ay gumawa ng hakbang na iligtas ang kanyang mga tao sa pamamagitan ng kanyang sariling gawa ng awa. Ginawa niya ito sa pamamagitan ng isang tipan, na kilala bilang tipan ng Biyaya.</p>\n<p> </p>\n<p>Sa pamamagitan ng tipang ito ang Diyos mismo ay nagbibigay ng katiyakan sa katauhan ng walang hanggang Anak, na sa pamamagitan ng kanyang pasibo at aktibong pagsunod sa kanyang banal na buhay at sa kanyang mga pagdurusa at kamatayan, ay nagkamit ng isang katuwiran na ibinibigay sa mga hinirang. Sa pamamagitan din ng ganitong tipan, ang Diyos mismo ay nagbibigay ng bagong buhay sa pamamagitan ng Banal na Espiritu sa mga likas na namatay sa kasalanan, at dinadala sila sa kaalaman at karanasan ng kaligtasan.</p>\n<p> </p>\n<p>Sa batayan ng tipang ito, ang mga makasalanan ay naging kabahagi ng lahat ng mga pagpapalang kalikasan ng ebanghelyo, tungkol sa kanilang katayuan sa harap ng Diyos, na ganap na napalaya mula sa pagkakasala ng kasalanan; at tungkol sa kanilang karanasan, nailigtas mula sa kapangyarihan ng kasalanan bagaman ang pagkakaroon at impluwensya nito ay nasa kanila pa rin.</p>\n<p> </p>\n<p>Ang tipang ito ay buong biyaya, sapagkat ito ay ginawang isang unilateral at kusang-loob na gawain ng Diyos at nakasalalay lamang sa banal na aktibidad ng Trinidad para sa katuparan nito. Ito rin ay walang hanggan, na minsan at para sa lahat ay nasiguro sa mananampalataya sa pamamagitan ng sakripisyong kamatayan ni Kristo, at partikular dahil ang mga pakinabang nito ay personal at indibidwal na iginawad sa mga hinirang.</p>\n<p> </p>\n<cite>-THE PRENTICE’S DIGLOT ON “THE 1966 BAPTIST AFFIRMATION OF FAITH, THE DOCTRINE OF THE GRACE OF GOD, 2. THE COVENANT OF GRACE [ENGLISH-TAGALOG]</cite></blockquote>\n</figure>\n<p class=\"align-center\">Now may the God of peace who by the blood of the eternal covenant brought back from the dead the great shepherd of the sheep, our Lord Jesus Christ, equip you with every good thing to do his will, working in us what is pleasing before him through Jesus Christ, to whom be glory forever. Amen.<br><br>Hebrews 13:20‭-‬21 NET</p>\n<p> </p>\n<p>Tunay na naparaming spiritual blessings ang dulot ng covenant, ilan sa mga bagay nito ay pinawalang sala tayo sa pamamagitan ng perfect obedience ng Panginoon Jesus. Sapagkat Sya ang ating dakilang Pastor.</p>\n<p>Sa covenant na ito, naging bahagi tayo ng mga tao ng Diyos. Na ang layunin ng Diyos ay gawin ang Kanyang matuwid na hangarin. Ihanda tayo sa kaluwalhatiang darating. Bahagi ng Kanyang paghahanda sa atin ay i-equip tayong gawin ang kalooban N’ya. Ang luwalhatiin at paglingkuran Siya.</p>\n<p> </p>\n<p class=\"align-center\">For by grace you are saved through faith, and this is not from yourselves, it is the gift of God; For we are his workmanship, having been created in Christ Jesus for good works that God prepared beforehand so we may do them. Therefore remember that formerly you, the Gentiles in the flesh – who are called “uncircumcision” by the so-called “circumcision” that is performed on the body by human hands – that you were at that time without the Messiah, alienated from the citizenship of Israel and strangers to the covenants of promise, having no hope and without God in the world. But now in Christ Jesus you who used to be far away have been brought near by the blood of Christ. For he is our peace, the one who made both groups into one and who destroyed the middle wall of partition, the hostility, when he nullified in his flesh the law of commandments in decrees. He did this to create in himself one new man out of two, thus making peace, and to reconcile them both in one body to God through the cross, by which the hostility has been killed. And he came and preached peace to you who were far off and peace to those who were near, so that through him we both have access in one Spirit to the Father. So then you are no longer foreigners and non citizens, but you are fellow citizens with the saints and members of God’s household, because you have been built on the foundation of the apostles and prophets, with Christ Jesus himself as the cornerstone. In him the whole building, being joined together, grows into a holy temple in the Lord, in whom you also are being built together into a dwelling place of God in the Spirit. <br>Ephesians 2:8‭-‬22 NET</p>\n<p class=\"align-center\">For the grace of God has appeared, bringing salvation for all people, instructing us to deny godlessness and worldly lusts and to live in a sensible, righteous, and godly way in the present age, while we wait for the blessed hope, the appearing of the glory of our great God and Savior, Jesus Christ. He gave himself for us to redeem us from all lawlessness and to cleanse for himself a people for his own possession, eager to do good works.<br><br>Titus 2:11‭-‬14 CSB</p>\n<p>Sa panahon natin ang paggawa ng mga mabubuti ay naka-focus sa sailing imahen ( para maging sikat), sa pakinabang material na maidudulot (tumutulong dahil may balik pakinabang), sa ibang hangarin (upang makamtan ang nais na outcome na salungat sa kalikasan ng pagtulong). Hindi natin minamasama ang mga pagtulong isinasagawa ng maraming tao para sa kapwa nya tao. Ngunit ang pinupunto natin dito, san nakasentro ang paggawa natin ng mga mabubuting gawa. Isang malaking hamon sa atin ang response ng mga naunang cristiano. Ang sentro ng pagkilos nila ay ang glory of God at ang pag-ibig nila sa Panginoon. Wala silang bakuna pero tayo meron. May accessible tayong goods pero sila salat. Hindi nila alintana ang peligro pero tayo naninisi, nanamantala o natatakot. Kakaunti lang ang bilang nila kumpara sa panahon. Ngunit sumulong at umusbong sila, dahil ang Probidensya ng Diyos ay isang karangalan at privilege na lumuwalhati sa Soberanong Diyos.</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<p>(Rom. 4:20; 1 Cor. 10:31; Ephesians 1:3‭-‬23; ch. 2; 2 Tim.4:18; 1 Pet. 4:14; 5:10)</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<p>2. To them, this is the way how God expands His kingdom.</p>\n<p>Sa mga naunang mga cristiano, alam nila na bahagi ng pagiging cristiano ang mensahe ng Gospel. Ang salitang gospel ay galing sa salitang euaggelion. Na ang literal na kahulugan nito ay ‘good news’, ‘glad tidings’. Sa tuwing ipinapangaral nila ang gospel sa kalagitnaan nila o naririnig sa kanila ng mga pagano ang salitang gospel ay may connotation ng isang kaharian paglalarawan [paghahayag] o imperial inscription. Kaya ng mga panahong iyon ay nami-misrepresent sila. Kaya para sa panahon ng Roman empire ang tanging Panginoon at hari ay si Caesar. Alam nila [ng mga cristiano nuon] na bahagi sila ng isa pang kaharian. Kaharian na mas higit pa sa mga kaharian ng mga tao. Ang hari ng Kanilang kaharaian ay Hari ng mga hari at Panginoon ng mga panginoon. Ang mensahe ng kahariang nito ay higit pa at mas makapangyarihan kaysa dami ng karunungang taglay ng mga kaharian ng mga tao. Kaakibat sa pagiging cristiano ang mensahe ng kaharian ng Diyos. Nagdulot ito ng persecution, indifference ng maraming tao, misrepresentation sa kanila ito. Ngunit ang mga bagay na ito ay may mga paunang wika ang Panginoong Jesus at maging ang mga apostol nabanggit din ang mga ito. May persecution, sakuna man o anumang sitwasyon o saan man lugar ang mga unang cristiano ay naipapahayag ang gospel. Naipapahayag mensahe ng kaharian.</p>\n<p>Nuong panahon ni Augustus Caesar, common lang gamitin ang salitang gospel. Para sa kanila, ang paghahari ni Augustus Caesar ay simula ng bagong pag-asa, ang pamamahala o paghahari ng kapayaan. Ngunit ito’y taliwas sa kanilang pagsasagawa.</p>\n<p>Di tulad ng mga naunang cristiano, iba at natatangi ang pagkagamit nila sa gospel.</p>\n<p>Una, ito’y kapahayagan ng Diyos sa mga tao Niya at maging sa sanlibutang laban sa katwiran ng Diyos. Ipinahayag ng Diyos ang isang kaharian at ito ang Kanyang  kaharian. Ang Kaharian ng Diyos ay kaharian ng liwanag, pag-ibig at katwiran. Ipinahayag Nya ito sa pamamgitan ng Scriptures. Ang Kasulatan ay ang Covenantal Revelation ng Diyos. Masasabi natin ayon sa Salita ng Diyos ang “Promise”, o ang ” Oath” ng Diyos ang pundasyon ng covenant. Sa promise o oath ng Diyos, ang Diyos ay unconditionally na gumawa ng pakikipagrelasyon sa pamamagitan nito. Bagamat sadyang napalaki ng agwat sa pagitan ng Diyos at ng tao. Dahil ang Diyos ang ating Creator. Tayo ang Kanyang mga nilikha. Lalong lumayo pa ang agwat na ito ng dahil sa nagkasala ang tao sa Diyos. Kahit Hindi pa nagkasala ang tao ay inabot na ng Diyos ang tao sa pamamagitan ng Tipan. Dahil ang Diyos ang Sovereign Ruler, ipinahayag Nya ito sa pamamagitan ng din ng Tipan. Kaya masasasabi natin na ang Scriptures ay ang kapahayagan ng kaharian ng Diyos sa pamamagitan ng covenant. Isa sa layunin ng Diyos, na pangunahan o pamahalaanan ng tao ang lahat ng mga nilikha ng Diyos. Nabigo dito si Adam. Kaya ang buong sangnilikha ng Diyos ay napasailalim sa kaharian ng kadiliman, kaguluhan at laban sa katwiran ng Diyos dahil sa pagiging unrighteous. Sa pagkabigo o pagkahulog ng tao sa kasalanan, ang Diyos ay nagsabing na may darating na dudurog sa ulo ng ahas o ni Satanas. Progressibong inihayag ng Salita ng Diyos, na ang dudurog sa ulo ni Satanas ay magagaling sa pamilya ni Abraham, gaya ng pakikipagtipan ng Diyos kay Adam ay nakipagtipan din sya Kay Abraham. Lilitaw ang binhi [walang iba kundi ang Panginoong Jesus] kay Abraham. Ayon din sa sinabi ng Diyos, ang pamilyang ito ay magiging kaharian. Inihanda mula kay Moses tungo Kay David. Ang Diyos ay nakipagtipan Kay Moses na ang Israel ay magiging isang kaharian ng mga saserdote. Ganun din kay David, nakipagtipan ang Diyos. Na sa kanyang linya o angkan lilitaw ang isang Hari. Uupo ito sa trono ni David at mamumuno ito magpakailanman. Ang pamumuno Nya ay ayon sa Kanyang kapangyarihan at katwiran. Sa pamumuno Niya madudulot ng kapayapaan at katwiran sa Kanyang Kaharian. Nabigo man sina Abraham, ang Israel at si David. Hindi ang Tipan ng Diyos. Ayon sa mga propeta magkakaroon ng isang Bagong Tipan. Ito ay hindi gaya ng dati, dahil hindi ito mabibigo. Naganap ang mga tinuran ng mga propeta nang dumating  ang Panginooong Jesus. Tinupad ng Diyos ang Kanyang Tipan. Dumating ang Hari ayon sa mga propesiya. Sinabi ng  Panginoong Jesus,</p>\n<p class=\"align-center\">“The time  is fulfilled, and the kingdom of God  has come  near.  Repent  and believe  the good news!”<br><br>Mark 1:15 CSB</p>\n<p>Dumating ang Hari at Kanyang ideneklara na pumasok sa Kanyang kaharian. Sa pamamagitan ng pagsisisi at pananampalataya sa gospel. Sinabi din ng Kasulatan na ang bahagi ng kaharian ito o mga taong kaharian ito ay ang new covenant people. Ang new covenant people ay ang Iglesia. Inatasan ng Panginoon na ipangaral ang gospel sa buong sangnilikha.</p>\n<p>Ang Kasulatan ay ang Covenantal Revelation ng Diyos.</p>\n<p>Pangalawa, ipinapahayag at ginagawang ganap ng Holy Spirit ang pagkabuo at paglaganap ng kaharian ng Diyos</p>\n<p>Ang Espiritu ng Diyos ang Syang may dahilan ng regeneration. Sa regeneration binibigyang buhay ang taong patay sa harapan ng Diyos at nagkakaroon ng kakayahang makita ang Kaharian ng Diyos at lumapit sa Hari ng Kahariang ito. Walang iba mundo ang Panginoong Jesus. Sa pagsisisi ay nakikita ang bigat ng kasalanan at dulot nito. Kaya ganap niyang nakikita ang tunay na pagkakilala sa Diyos at sa sariling nagkasala sa Diyos. Nangangailangan ng kapatawaran at lumalapit sa Diyos. Sa pananampalataya ay inaaring ganap at nagiging bahagi ng pamilya ni Abraham sa pamamagitan ng Panginoong Jesu-Cristo. Ang Banal na Espiritu ang Syang nangangasiwa at nagbibigaya kaaliwan sa Iglesia.</p>\n<p>Mula ng ibigay ng Panginoong Jesu-Cristo ang Great Commission. Ito’y iniatas sa Iglesia upang ihayag ang good news ng kaharian ng Diyos. Kahit na may persecution, famine, sakuna o epidemic o pandemic man ang danasin ng mga new covenant people. Magpapatuloy ang kaharian ng Diyos hanggang sa Consummation. Ang mga naunang cristiano nalalaman nila na bahagi sila ng kaharian ng Diyos at sa kaharian ito nararapat na isapamuhay ang pagiging kingdom citizen. Ang Probidensya ng Diyos para sa kanila ito ang pagpapalawak ng kaharian ng Diyos hanggang sa ito ay maging ganap (consummated).</p>\n<p> </p>\n<p>Mark 1:14‭-‬15; Luke 8:1; 16:16; Acts 8:12; 14:22; 19:8; 28:23,31; 2 Thess. 1:5;  Rev. 12:10</p>\n<p>3. To them, this is a gracious and loving purpose of God.</p>\n<p class=\"align-center\">For all who are led by the Spirit of God are the sons of God. For you did not receive the spirit of slavery leading again to fear, but you received the Spirit of adoption, by whom we cry, “Abba, Father.” The Spirit himself bears witness to our spirit that we are God’s children. And if children, then heirs (namely, heirs of God and also fellow heirs with Christ) – if indeed we suffer with him so we may also be glorified with him. For I consider that our present sufferings cannot even be compared to the glory that will be revealed to us. For the creation eagerly waits for the revelation of the sons of God. For the creation was subjected to futility – not willingly but because of God who subjected it – in hope that the creation itself will also be set free from the bondage of decay into the glorious freedom of God’s children. For we know that the whole creation groans and suffers together until now. Not only this, but we ourselves also, who have the firstfruits of the Spirit, groan inwardly as we eagerly await our adoption, the redemption of our bodies.  For in hope we were saved. Now hope that is seen is not hope, because who hopes for what he sees? But if we hope for what we do not see, we eagerly wait for it with endurance.  In the same way, the Spirit helps us in our weakness, for we do not know how we should pray, but the Spirit himself intercedes for us with inexpressible groanings. And he who searches our hearts knows the mind of the Spirit, because the Spirit intercedes on behalf of the saints according to God’s will. And we know that all things work together for good for those who love God, who are called according to his purpose, because those whom he foreknew he also predestined to be conformed to the image of his Son, that his Son would be the firstborn among many brothers and sisters.  And those he predestined, he also called; and those he called, he also justified; and those he justified, he also glorified. What then shall we say about these things? If God is for us, who can be against us? Indeed, he who did not spare his own Son, but gave him up for us all – how will he not also, along with him, freely give us all things? Who will bring any charge against God’s elect? It is God who justifies. Who is the one who will condemn? Christ is the one who died (and more than that, he was raised), who is at the right hand of God, and who also is interceding for us. Who will separate us from the love of Christ? Will trouble, or distress, or persecution, or famine, or nakedness, or danger, or sword?  As it is written, “ For your sake we encounter death all day long; we were considered as sheep to be slaughtered .”  No, in all these things we have complete victory through him who loved us! For I am convinced that neither death, nor life, nor angels, nor heavenly rulers, nor things that are present, nor things to come, nor powers, nor height, nor depth, nor anything else in creation will be able to separate us from the love of God in Christ Jesus our Lord.<br><br>Romans 8:14‭-‬39 NET</p>\n<p>Para sa mga naunang cristiano, ang mga nangyayari o mangyayari pa sa mundo [gaya ng paglindol, pagbaha o mga sakunang kalikasan] ay bahagi ng sumpa ng kasalanan. Kahinaan o ang pagkakasakit ng katawang lupa ay bahagi din ng sumpa ng kasalanan. Kung may kasalatan, persecution, kagutuman, panganib, kahit na ang mga panglupang pamahalaan o mga gawa ng kaaway na si Satanas. Sa Probidensya ng Diyos ay Kanyang inihahayag ang Kanyang pag-ibig, pagkalinga, pangunguna sa Kanyang mga tao bilang Hari at Ama. Maaring ito’y hayagan o mysteriously. Mapagtatanto lang nation ng dahil sa Kanyang mga Salita at ang pangunguna ng Banal na Espiritu sa ating mga buhay.</p>\n<p> </p>\n<p>Romans 8:28–39; 12:9-21; Phil. 1:3-21 2:13; 4:4-20;  2 Tim. 2:3; 1 Pet. 2:15; 3:17; 4:19</p>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<h4>Coram Deo: Living before the Presence of God</h4>\n<ul>\n<li>Extol God’s providence.</li>\n<li>SUBMIT to the gracious divine providence of God, patiently and faithfully.</li>\n<li>Let the providence be a remedy against our worthless fear.</li>\n<li>Let the merciful providence of God cause THANKFULNESS.</li>\n</ul>\n<hr class=\"wp-block-separator\">\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<p>Recommended to read:</p>\n<ol>\n<li>God’s Providence by Charles H. Spurgeon</li>\n<li>History of Providence As Manifested in the Scripture by Alexander Carson</li>\n<li>Sovereignty of God in Providence by John G. Reisinger</li>\n<li>It is Well: Submitting to God’s Providence by John Hill</li>\n<li>Doctrine of Divine Providence by Dale M. Crawford</li>\n<li>Suffering and Sovereignty by Brian H. Cosby</li>\n<li>The Mystery of Providence by John Flavel</li>\n<li>God’s Greater Glory by Bruce A. Ware</li>\n</ol>\n<div class=\"wp-block-spacer\" aria-hidden=\"true\"> </div>\n<p>References:</p>\n<ol>\n<li>CoVid 19 Record cases 15k plus</li>\n<li>The Atom Araullo Specials: COVID-19: Nang Tumigil Ang Mundo | Full Episode</li>\n<li>Timeline: Pandemic in the Philippines| Rappler</li>\n<li>OUTBREAK: 10 OF THE WORST PANDEMICS IN HISTORY</li>\n<li>Institute of Christian Religion, Book 1 Chapter 17: Use to be made of the doctrine of providence, section 11 The use of the foregoing meditation.</li>\n<li>1966 The Strict Baptist Affirmation of Faith 4.1 translated in Tagalog</li>\n<li>The Baptist Larger Catechism, question 20 translated in Tagalog</li>\n<li>Theological Reflections on the Pandemic, Brian Tabb</li>\n<li>Thucydides. History of the Peloponnesian War,  Volume I: Books 1-2. [Translated by CF Smith].  Loeb Classical Library 108. Cambridge, MA:  Harvard University Press; 1919. p. 349–51.</li>\n<li>Spanish Flu – Symptoms, How It Began &amp; Ended – HISTORY</li>\n</ol>\n<p> </p>\n<p> </p>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td class=\"align-center\" style=\"width: 33.3333%;\"><strong><a href=\"https://prenticepoint.github.io/tritavlogcast/learn-more.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Learn More</a></strong></td>\n<td class=\"align-center\" style=\"width: 33.3333%;\"><strong><a href=\"https://prenticepoint.github.io/tritavlogcast/support-our-cause.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Support Our Cause</a></strong></td>\n<td class=\"align-center\" style=\"width: 33.3333%;\"><strong><a href=\"https://prenticepoint.github.io/tritavlogcast/ask-a-question.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Ask a Question</a></strong></td>\n</tr>\n</tbody>\n</table>\n<p> </p>\n<p>\n<script> \n(function() { // REQUIRED CONFIGURATION VARIABLE: EDIT THE SHORTNAME BELOW\nvar d = document, s = d.createElement('script'); // IMPORTANT: Replace EXAMPLE with your forum shortname!\ns.src = 'https://tritavlogcast.disqus.com/recommendations.js'; s.setAttribute('data-timestamp', +new Date());\n(d.head || d.body).appendChild(s);\n})();\n</script>\n<noscript>\nPlease enable JavaScript to view the \n<a href=\"https://disqus.com/?ref_noscript\" rel=\"nofollow\">\ncomments powered by Disqus.\n</a>\n<span id=\"mce_marker\" data-mce-type=\"bookmark\" data-mce-fragment=\"1\">​</span></noscript></p>\n</div>",
            "author": {
                "name": "1tritagonist"
            },
            "tags": [
                   "christianity",
                   "Scripture",
                   "Providence",
                   "Probidensya",
                   "Particular Baptist",
                   "Pandemya",
                   "Pandemic",
                   "God",
                   "Faith",
                   "Covenantal",
                   "Covenant",
                   "Confessional",
                   "Church",
                   "Christ",
                   "Bible"
            ],
            "date_published": "2021-04-22T00:00:00+08:00",
            "date_modified": "2021-06-09T21:52:12+08:00"
        }
    ]
}
